import random

from turtle import*

setup(width=1.0, height=1.0)
bgcolor("darkblue")
width(9)
speed(5)

#border
penup()
goto(0,300)
pendown()
forward(200)
right(90)
forward(400)
right(90)
forward(400)
right(90)
forward(400)
right(90)
forward(400)


penup()
goto(0,100)
pendown()
left(45)
forward(200)
right(180)
forward(400)

#name
#L
penup()
goto(-125,-150)
pendown()

left(45)
forward(100)
left(90)
forward(50)

#P
penup()
goto(-25,-250)
pendown()
left(90)
forward(100)
right(90)
forward(50)
right(90)
forward(50)
right(90)
forward(50)

#B
penup()
goto(75,-150)
pendown()
left(90)
forward(100)
left(90)
forward(15)
circle(25 , extent=180)
forward(15)
left(180)
forward(15)
circle(25 , extent=180)
forward(15)


#middle L
color("blue")
penup()
goto(50,50)
pendown()
left(90)
forward(100)
left(90)
forward(50)

#lari
penup()
goto(-150,150)
pendown()
forward(150)
left(90)
forward(100)
left(90)
forward(150)
left(90)
forward(100)
left(90)

penup()
goto(-100,170)
pendown()

forward(50)

penup()
goto(-50,195)
pendown()

left(90)

circle(25, extent=270)
right(90)


penup()
goto(-65,225)
pendown()

forward(20)

penup()
goto(-85,225)
pendown()

forward(20)



exitonclick()







h1 = "კეთილი იყოს თქვენი მობრძანება LPB -- Less Persent Bank-ში"
h2 = "დილა მშვიდობისა! კეთილი იყოს თქვენი მობრძანება LPB -- Less Persent Bank-ში"
h3 = "შუადღე მშვიდობისა! კეთილი იყოს თქვენი მობრძანება LPB -- Less Persent Bank-ში"
h4 = "საღამო მშვიდობისა! კეთილი იყოს თქვენი მობრძანება LPB -- Less Persent Bank-ში"
h5 = "გამარჯობა როგორ ბრძანდებით, გმადლობთ რომ ირჩევთ ჩვენს ბანკს"
ran_h = [h1,h2,h3,h4,h5]


print(random.choice(ran_h))
print("ჩვენ გთავაზობთ დაბალ პროცენტიან სესხებს და საკომისიოებს")
print("ჩვენთან თქვენ შეძლებთ მარტივად და სწრაფად მიიღოთ საჭირო ფინანსური მომსახურეობა")
print("ჩვენს ბანკში თქვენ შეგიძლიათ მიიღოთ სხვადასხვა სერვისებიდან არჩვნის საშუალება, როგორებიცაა სესხი, ანაბარი,  და გადარიცხვა")

a = input("გთხოვთ აირჩიოთ ზემოხსენებული სერვისებიდან ერთერთი")

while a not in ["სესხი" , "ანაბარი" ,"გადარიცხვა"]:
     print("ჩვენს ბანკში თქვენ შეგიძლიათ მიიღოთ სხვადასხვა სერვისებიდან არჩევნის საშუალება, როგორებიცაა სესხი, ანაბარი, cashout და გადარიცხვა")
     a= input("გთხოვთ აირჩიოთ ზედმოხსენებული სერვისებიდან ერთერთი")


if a == "სესხი":
    amount = int(input("რა თანხის გატანა გსურთ"))
    while amount>500000:
        print("ჩვენს ბანკში სესხებს გავცემთ 50000 ლარამდე")
        amount = int(input("რა თანხის გატანა გსურთ"))
    
    years= int(input("რამდენწლიანი სესხის გატანა გსურთ"))
    while years not in [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]:
        print("ჩვენს ბანკში სესხი გაიცემა 1იდან 15 წლამდე")
        years= input("რამდენწლიანი სესხის გატანა გსურთ")
    
    
    if years in [1,2,3,4,5]:
     if amount <= 4500:
         annual_rate = 0.12  #  წლიური განაკვეთი 12%
     if 4500 < amount <= 10000:
        annual_rate = 0.09  # წლიური განაკვეთი 9%
     if 10000 < amount <= 50000:
        annual_rate = 0.078  # წლიური განაკვეთი 7.8%
     if 50000 < amount <= 500000:
        annual_rate = 0.018  # წლიური განაკვეთი 1.8%
    


    if years in [6,7,8,9,10]:
     if amount <= 4500:
        annual_rate = 0.16  #  წლიური განაკვეთი 16%
     if 4500 < amount <= 10000:
        annual_rate = 0.10  # წლიური განაკვეთი 10%
     if 10000 < amount <= 50000:
        annual_rate = 0.08  # წლიური განაკვეთი 8%
     if 50000 < amount <= 500000:
        annual_rate = 0.03  # წლიური განაკვეთი 3%

    if years in [11,12,13,14,15]:
     if amount <= 4500:
         annual_rate = 0.2  #  წლიური განაკვეთი 20%
     if 4500 < amount <= 10000:
        annual_rate = 0.13  # წლიური განაკვეთი 13%
     if 10000 < amount <= 50000:
        annual_rate = 0.10  # წლიური განაკვეთი 10%
     if 50000 < amount <= 500000:
        annual_rate = 0.04  # წლიური განაკვეთი 4%





    print("თქვენ გნებავთ "+str(amount)+" ლარის გატანა "+str(years)+" წლით.თქვენ  წლიური გადასახადი იქნება "+str(int(amount/years*(1+annual_rate)))+
               ".თვიურად მოგიწევთ"+str(int(amount/years*(1+annual_rate)/12))+"სულ მოგიწევთ"+str(int(amount*(1+annual_rate)))+" ლარის გადახდა.")


if a == "ანაბარი":
    b = input("რისკიანი ანაბარი გსურთ თუ ნაკლებად რისკიანი ")
    while b not in ["რისკიანი", "ნაკლებად რისკიანი"]:
     print("გთხოვთ მიუთითეთ რისკიანი ანაბარი გსურთ თუ ნაკლებად რისკიანი ")
     b= input("რისკიანი ანაბარი გსურთ თუ ნაკლებად რისკიანი ")
    if b== "რისკიანი":

        c= int(input("how much:"))
        if c <= 1500:
             print("რისკიანი ანაბრის(<= 1500) ყოველწლიური პროცენტია მარტრივი 25% ხოლო ეს თქვენს შემთხვევაში იქნება ---" + str(c*0.25)
              + "--- ყოველწლიურად")
        else:
            print("რისკიანი ანაბრის(>= 1500) ყოველწლიური პროცენტია რთული 25% ხოლო ეს თქვენს შემთხვევაში იქნება ---")
            for i in range(1,10):
                c= int(c*1.25)
                print("მე-"+str(i)+ " წელი: " + str(c))
    
    if b== "ნაკლებად რისკიანი":
        c= int(input("how much:"))
        print("ნაკლებად რისკიანი ანაბრის  ყოველწლიური პროცენტია მარტრივი 10% ხოლო ეს თქვენს შემთხვევაში იქნება ---" + str(int(c*0.1))
         + "--- ყოველწლიურად")

if a == "გადარიცხვა":
    a = input("გთხოვთ აირჩიოთ რომელ ბანკში გნებავთ თანხის გადარიცხვა")
    while a not in ["საქართველოს ბანკი","თიბისი ბანკი","ლიბერთი ბანკი"]:
        print("გთხოვთ აირჩიოთ ჩამოთვლილი ბაკებიდან ერთერთი:საქართელოს ბანკი, თიბისი ბანკი, ლიბერთი ბანკი")
        a = input("გთხოვთ აირჩიოთ რომელ ბანკში გნებავთ თანხის გადარიცხვა")
    if a == ("საქართველოს ბანკი"):
        print("გთხოვთ აირჩიოთ გადასარიცხი თანხა,თუ თანხა ნაკლებია 10 000 -ზე გადარიცხვის საკომისიოა 7%,ხოლო 10 000 -ზე მეტ გადარიცხვაზე საკომისიოა 4%")
        c = int(input("რამდენის გადარიცხვა გსურთ"))
        if c <= 10000 :
            print("თქვენი გადასახელი თანხა იქნება" + str(c*0,93))
        else:
            print("თქვენი გადასახდელი თანხა იქნება" + str(c*0.96))

    if a == ("თიბისი ბანკი"):
        print("გთხოვთ აირჩიოთ გადასარიცხი თანხა,თუ თანხა ნაკლებია 15 000 -ზე გადარიცხვის საკომისიოა 8% , ხოლო 15 000 -ზე მეტ გადარიცხვაზე საკომისიოა 3%  ")
        b = int(input("რამდენის გადარიცხვა გსურთ"))
        if b <= 15000:
            print("თქვენი გადასახდელი თანხა იქნება " + str(b*0.92))
        else:
           print("თქვენი გადასახდელი თანხა იქნება"+str(b*0.97))

    if a == ("ლიბერთი ბანკი"):
        print("გთხოვთ აირჩიოთ გადასარიცხი თანხა,თუ თანხა ნაკლებია 20 000 -ზე გადარიცხვის საკომისიოა 5% , ხოლო 20 000 -ზე მეტ გადარიცხვაზე საკომისიოა 3% ")
        c = int(input("რამდენის გადარიცხვა გსურთ"))
        if c <= 20000:
           print("თქვენი გადასახდელი თანხა იქნება"+str(c*0.95) )
        else:
            print("თქვენი გადასახდელი თანხა იქნება "+str(c*0.97))


